52-Legacy-Integration/52-Legacy-Integration/soap_envelope.xml

<!-- SOAP is Verbose, but it is Self-Describing and Strictly Typed -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <getAccountDetails xmlns="http://bank.com/services">
         <accountID>123456789</accountID>
      </getAccountDetails>
   </soapenv:Body>
</soapenv:Envelope>
